'''
200. Number of Islands

Для m x n двумерной бинарной сетки grid с ячейками '1' (суша) и '0' (вода) верните количество островов.

Остров окружен водой и образован путем соединения соседних участков суши по горизонтали или вертикали. 
Можно считать, что все четыре края сетки окружены водой.

Пример 1:

Входные данные: сетка = [
 ["1","1","1","1","0"],
 ["1","1","0","1","0"],
 ["1","1","0","0","0"],
 ["0","0","0","0","0"]
]
Результат: 1
Пример 2:

Входные данные: сетка = [
 ["1","1","0","0","0"],
 ["1","1","0","0","0"],
 ["0","0","1","0","0"],
 ["0","0","0","1","1"]
]
Результат: 3

Ограничения:

m == grid.length
n == grid[i].length
1 <= m, n <= 300
grid[i][j] является '0' или '1'.
'''